## Pandas
One of the best options for working with tabular data in Python is to use the Python Data Analysis Library (a.k.a. Pandas). The Pandas library provides DataFrame data structure, produces high quality plots with matplotlib and integrates nicely with other libraries that use NumPy arrays.

Here is an example of the data set (gapminder) that is best represented by the DataFrame
 https://github.com/AnnaWilliford/SWC_Fall2019_test/blob/master/gapminder.txt

In [418]:
import pandas as pd
import numpy as np

### Creating Data Frames:

In [419]:
#From dictionaries
grades={'name':['Amy', 'Mike','Jake','Rose']
        ,'status':['sophmore','freshman','junior','freshman']        
        ,'hw1':[10,4,9,10]
        ,'hw2':[8,6,9,10]
        ,'test':[88,79,93,99]}

In [420]:
grades_df=pd.DataFrame(grades)
grades_df

   name    status  hw1  hw2  test
0   Amy  sophmore   10    8    88
1  Mike  freshman    4    6    79
2  Jake    junior    9    9    93
3  Rose  freshman   10   10    99

In [421]:
#from numpy arrays
df = pd.DataFrame(data=np.array([['Mia', 2, 3], ['Jane', 5, 6]]), index= ['a','b'], columns=['name','hw1','hw2'])
df

   name hw1 hw2
a   Mia   2   3
b  Jane   5   6

In [422]:
df.hw1+df.hw2

a    23
b    56
dtype: object

In [423]:
df.hw1=df.hw1.astype(np.int)
df.hw2=df.hw2.astype(np.int)
df.hw1+df.hw2

a     5
b    11
dtype: int64

In [424]:
df2 = pd.DataFrame(data=np.arange(6).reshape(3,2), index= ['a','b','c'], columns=['hw1','hw2'])
df2

   hw1  hw2
a    0    1
b    2    3
c    4    5

In [425]:
df2.hw1+df2.hw2

a    1
b    5
c    9
dtype: int64

### The structure of the data frame

In [426]:
grades_df.shape

(4, 5)

**DataFrame = data + columns + index. You can access each of these components**

In [427]:
grades_df.values

array([['Amy', 'sophmore', 10, 8, 88],
       ['Mike', 'freshman', 4, 6, 79],
       ['Jake', 'junior', 9, 9, 93],
       ['Rose', 'freshman', 10, 10, 99]], dtype=object)

In [428]:
grades_df.columns

Index(['name', 'status', 'hw1', 'hw2', 'test'], dtype='object')

In [429]:
grades_df.index

RangeIndex(start=0, stop=4, step=1)

### Subsetting dataframe:  
There are three main options to extract(select) parts of the data frame

1. Selecting data by index
2. Selecting data by label
3. Selecting data by a conditional statment/logical statements

In [430]:
grades_df

   name    status  hw1  hw2  test
0   Amy  sophmore   10    8    88
1  Mike  freshman    4    6    79
2  Jake    junior    9    9    93
3  Rose  freshman   10   10    99

#### Select by index  
`df.iloc[<row index>, <column index>]`

In [431]:
#Get a single element
grades_df.iloc[0,2]

10

In [432]:
#Get column
grades_df.iloc[:,2]

0    10
1     4
2     9
3    10
Name: hw1, dtype: int64

In [433]:
#Get multiple columns
grades_df.iloc[:,[1,3]]

     status  hw2
0  sophmore    8
1  freshman    6
2    junior    9
3  freshman   10

In [328]:
grades_df

   name    status  hw1  hw2  test
0   Amy  sophmore   10    8    88
1  Mike  freshman    4    6    79
2  Jake    junior    9    9    93
3  Rose  freshman   10   10    99

In [434]:
#select rows and columns
grades_df.iloc[[2],0:3]

#here index of the third row is given in a list, this keeps output as a dataframe
print(type(grades_df.iloc[[2],0:3]))
print(type(grades_df.iloc[2,0:3]))

grades_df.iloc[[2],0:3]

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

   name  status  hw1
2  Jake  junior    9

In [435]:
#get a row
grades_df.iloc[[2],:]

   name  status  hw1  hw2  test
2  Jake  junior    9    9    93

In [437]:
#get multiple rows
grades_df.iloc[0:3,:]

   name    status  hw1  hw2  test
0   Amy  sophmore   10    8    88
1  Mike  freshman    4    6    79
2  Jake    junior    9    9    93

#### Select by label:  
`df.loc[<row label>, <column label>]`  
or:  
`df[<column label>]`  
or:
`df.<column label>`

In [438]:
grades_df

   name    status  hw1  hw2  test
0   Amy  sophmore   10    8    88
1  Mike  freshman    4    6    79
2  Jake    junior    9    9    93
3  Rose  freshman   10   10    99

In [439]:
grades_df.loc[:,'hw1']

0    10
1     4
2     9
3    10
Name: hw1, dtype: int64

In [440]:
grades_df.loc[1:3,['hw1','hw2']]

   hw1  hw2
1    4    6
2    9    9
3   10   10

### Challenge
Explain the difference in the output of these two commands:  
`grades_df.loc[1:3,:]`  
and  
`grades_df.iloc[1:3,:]`

In [441]:
#We can change index
grades_df.index=['st1','st2','st3','st4']
grades_df

     name    status  hw1  hw2  test
st1   Amy  sophmore   10    8    88
st2  Mike  freshman    4    6    79
st3  Jake    junior    9    9    93
st4  Rose  freshman   10   10    99

In [442]:
grades_df.loc[['st1']]

    name    status  hw1  hw2  test
st1  Amy  sophmore   10    8    88

In [443]:
#reset index  creates new data frame
#This comes handy when index is needed to be used as a column.
grades_df=grades_df.reset_index(drop=True)
grades_df

   name    status  hw1  hw2  test
0   Amy  sophmore   10    8    88
1  Mike  freshman    4    6    79
2  Jake    junior    9    9    93
3  Rose  freshman   10   10    99

In [444]:
### Selecting columns by name
# as if dataframe is a dictionary
grades_df[['name']]
grades_df['name']

0     Amy
1    Mike
2    Jake
3    Rose
Name: name, dtype: object

In [445]:
#or using attribute
grades_df.name

0     Amy
1    Mike
2    Jake
3    Rose
Name: name, dtype: object

#### Select by logical statement

`df.loc[<row selection>, <column selection>]` where row selection is based on logical Pandas series  

With logical selection, you pass an array or Series of True/False values to the .loc indexer to select the rows where your Series has True values.

In [446]:
grades_df

   name    status  hw1  hw2  test
0   Amy  sophmore   10    8    88
1  Mike  freshman    4    6    79
2  Jake    junior    9    9    93
3  Rose  freshman   10   10    99

In [447]:
#Select records for Mike
grades_df.loc[grades_df['name']=='Mike',]

#grades_df['name']=='Mike' identifies row index

   name    status  hw1  hw2  test
1  Mike  freshman    4    6    79

In [453]:
#or, but this is very confusing...
grades_df[grades_df['name']=='Mike']

   name    status  hw1  hw2  test
1  Mike  freshman    4    6    79

In [454]:
grades_df['name']=='Mike'

0    False
1     True
2    False
3    False
Name: name, dtype: bool

**How it works**  
`grades_df['name']=='Mike'` is `True` for index 1.  
So  
`grades_df.loc[grades_df['name']=='Mike',]`  
is the same as  
`grades_df.loc[1,]`

In [455]:
grades_df.loc[[1],]

   name    status  hw1  hw2  test
1  Mike  freshman    4    6    79

In [456]:
#students with hw1 score more than 7
grades_df.loc[grades_df['hw1']>7,['name','hw1']]

   name  hw1
0   Amy   10
2  Jake    9
3  Rose   10

### Adding columns and rows

In [459]:
grades_df

   name    status  hw1  hw2  test
0   Amy  sophmore   10    8    88
1  Mike  freshman    4    6    79
2  Jake    junior    9    9    93
3  Rose  freshman   10   10    99

In [460]:
#adding columns
grades_df['hw3']=[9,7,8,9]
#grades_df.iloc[:,[0,1,2,3,5,4]]
grades_df

   name    status  hw1  hw2  test  hw3
0   Amy  sophmore   10    8    88    9
1  Mike  freshman    4    6    79    7
2  Jake    junior    9    9    93    8
3  Rose  freshman   10   10    99    9

In [461]:
#adding rows
grades_df.loc[4]=['Dan','freshman',3,5,1,50]
grades_df

   name    status  hw1  hw2  test  hw3
0   Amy  sophmore   10    8    88    9
1  Mike  freshman    4    6    79    7
2  Jake    junior    9    9    93    8
3  Rose  freshman   10   10    99    9
4   Dan  freshman    3    5     1   50

### Deleting rows and columns

In [462]:
#delete column; creates new df without deleted columns
grades_df.drop(['hw1','hw2'],axis=1)

   name    status  test  hw3
0   Amy  sophmore    88    9
1  Mike  freshman    79    7
2  Jake    junior    93    8
3  Rose  freshman    99    9
4   Dan  freshman     1   50

In [463]:
#delete rows
grades_lessRows=grades_df.drop([1,2],axis=0)
grades_lessRows

   name    status  hw1  hw2  test  hw3
0   Amy  sophmore   10    8    88    9
3  Rose  freshman   10   10    99    9
4   Dan  freshman    3    5     1   50

In [464]:
grades_lessRows.index=[0,1,2]
grades_lessRows

   name    status  hw1  hw2  test  hw3
0   Amy  sophmore   10    8    88    9
1  Rose  freshman   10   10    99    9
2   Dan  freshman    3    5     1   50

### Sorting dataframes

In [465]:
grades_df

   name    status  hw1  hw2  test  hw3
0   Amy  sophmore   10    8    88    9
1  Mike  freshman    4    6    79    7
2  Jake    junior    9    9    93    8
3  Rose  freshman   10   10    99    9
4   Dan  freshman    3    5     1   50

In [466]:
grades_df.sort_index(axis=1)

   hw1  hw2  hw3  name    status  test
0   10    8    9   Amy  sophmore    88
1    4    6    7  Mike  freshman    79
2    9    9    8  Jake    junior    93
3   10   10    9  Rose  freshman    99
4    3    5   50   Dan  freshman     1

In [467]:
grades_df.sort_values(by='name')

   name    status  hw1  hw2  test  hw3
0   Amy  sophmore   10    8    88    9
4   Dan  freshman    3    5     1   50
2  Jake    junior    9    9    93    8
1  Mike  freshman    4    6    79    7
3  Rose  freshman   10   10    99    9

In [468]:
grades_df.sort_values(by=['status','name'])

   name    status  hw1  hw2  test  hw3
4   Dan  freshman    3    5     1   50
1  Mike  freshman    4    6    79    7
3  Rose  freshman   10   10    99    9
2  Jake    junior    9    9    93    8
0   Amy  sophmore   10    8    88    9

### Practice with gapminder data  
download data: https://github.com/AnnaWilliford/SWC_Fall2019_test/blob/master/gapminder.txt  
Click on `RAW`, save link as    

Read data in Python:  
`data = pd.read_csv("gapminder.txt", delimiter = "\t")`  

Answer these questions:


1. Can you extract 3rd and 5th column of the dataset?
2. Can you extract the list of countries in this dataset?  

*Hint: use `unique` method
3. Can you get a part of this dataset that includes information about Sweden?
4. Can you extract all countries for which life expectancy is below 70 in the year 1957?
5. Can you make a new column that contains population in units of millions of people?

**Challenge 3.1** Answers

1. data.iloc[:,[2,4]]
2. data.country.unique()
3. data[data.country == "Sweden" ]
4. data.loc[(data.lifeExp<70) & (data.year==1957)]
5. data['popM']=data['pop']/(10**6)

In [469]:
data = pd.read_csv("gapminder.txt", delimiter = "\t")
data.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [470]:
data.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [471]:
data.shape

(1704, 6)

In [472]:
#Can you extract 3rd and 5th column of the dataset?
data.iloc[:,[2,4]].head()

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [473]:
#Can you extract the list of countries in this dataset?
data['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia_and_Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina_Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central_African_Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo_Dem_Rep', 'Congo_Rep', 'Costa_Rica',
       "Cote_d'Ivoire", 'Croatia', 'Cuba', 'Czech_Republic', 'Denmark',
       'Djibouti', 'Dominican_Republic', 'Ecuador', 'Egypt',
       'El_Salvador', 'Equatorial_Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong_Kong_China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea_Dem_Rep',
       'Korea_Rep', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New_Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto_Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao_Tome_and_Principe', 'Saudi_Arabia', 'Senegal', 'Serbia',
       'Sierra_Leone', 'Singapore', 'Slovak_Republic', 'Slovenia',
       'Somalia', 'South_Africa', 'Spain', 'Sri_Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad_and_Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United_Kingdom', 'United_States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West_Bank_and_Gaza', 'Yemen_Rep',
       'Zambia', 'Zimbabwe'], dtype=object)

In [474]:
#Can you get a part of this dataset that includes information about Sweden?
data.loc[data.country=='Sweden']

     country continent  year  lifeExp      pop     gdpPercap
1464  Sweden    Europe  1952   71.860  7124673   8527.844662
1465  Sweden    Europe  1957   72.490  7363802   9911.878226
1466  Sweden    Europe  1962   73.370  7561588  12329.441920
1467  Sweden    Europe  1967   74.160  7867931  15258.296970
1468  Sweden    Europe  1972   74.720  8122293  17832.024640
1469  Sweden    Europe  1977   75.440  8251648  18855.725210
1470  Sweden    Europe  1982   76.420  8325260  20667.381250
1471  Sweden    Europe  1987   77.190  8421403  23586.929270
1472  Sweden    Europe  1992   78.160  8718867  23880.016830
1473  Sweden    Europe  1997   79.390  8897619  25266.594990
1474  Sweden    Europe  2002   80.040  8954175  29341.630930
1475  Sweden    Europe  2007   80.884  9031088  33859.748350

In [475]:
#Can you extract all countries for which life expectancy is below 70 in the year 1957?
data.loc[(data.lifeExp<70) & (data.year==1957)].head()

        country continent  year  lifeExp       pop    gdpPercap
1   Afghanistan      Asia  1957   30.332   9240934   820.853030
13      Albania    Europe  1957   59.280   1476505  1942.284244
25      Algeria    Africa  1957   45.685  10270856  3013.976023
37       Angola    Africa  1957   31.999   4561361  3827.940465
49    Argentina  Americas  1957   64.399  19610538  6856.856212

In [476]:
#Can you make a new column that contains population in units of millions of people?
data['popM']=data['pop']/(10**6)
print(data.head())

       country continent  year  lifeExp       pop   gdpPercap       popM
0  Afghanistan      Asia  1952   28.801   8425333  779.445314   8.425333
1  Afghanistan      Asia  1957   30.332   9240934  820.853030   9.240934
2  Afghanistan      Asia  1962   31.997  10267083  853.100710  10.267083
3  Afghanistan      Asia  1967   34.020  11537966  836.197138  11.537966
4  Afghanistan      Asia  1972   36.088  13079460  739.981106  13.079460